{
  "name": "People of the (concrete) jungle (submission to Illume 2023)",
  "description": "In this evocative piece, \"People of the (concrete) jungle\", we find ourselves immersed in a poignant reflection on the theme of \"care\" from three profound angles. This powerful painting depicts an orangutan mother and her baby treading resolutely through the decaying remnants of an abandoned city. Instead of their usual habitat of the Malaysian and Indonesian jungles, the pair of apes find themself in a concrete jungle. Amidst the desolation, the tender love and determination in the mother's eyes are a powerful testament to the lengths she will go to provide care and protection her cherished young one.\n\nHowever, beyond the tender connection between mother and child, this painting delves deeper into the notion of care on a planet-wide scale. The stark contrast between the vibrant orange hues of nature and the cool blue tones of human waste warns us against the relentless encroachment and destruction of natural habitats. With this haunting imagery, the painting raises an urgent cry to awaken our collective conscience to the profound impact of our actions on the environment. As we ponder this abandoned city, we are confronted with the consequences of our choices as a species. The city symbolizes the culmination of our disregard and lack of care for nature, and it serves as a somber reminder that our reckless actions not only harm the world around us but also bear heavy consequences for our own existence. The artist skillfully intertwines these warnings about humanity's self-inflicted wounds with the image of a forsaken city, urging us to reconsider our path and make a change for the better.\n\nYet, amidst this bleak landscape, a glimmer of hope emanates from the right side of the painting. A soft, warm light symbolizes the potential for redemption and a brighter future. It serves as a beacon of hope, urging us to recognize the mistakes of our past and work towards a more sustainable and compassionate world. The central figure of the mother orangutan, looking forward with a tinge of sadness in her eyes, embodies the weight of our collective responsibility, reminding us of our burden in shaping the world of tomorrow. On her back, her innocent and carefree baby plays joyfully, emphasizing that the future is not yet irrevocably sullied. Their bond conveys an unspoken message of resilience and interdependence, as we are all intrinsically connected within the intricate tapestry of life.",
  "medium": "Acrylic paint on canvas",
  "date": "2023-07-20"
}
